Revit 2016 API
PipingSystem.StaticPressure Property
 Indicates the computed static pressure for the piping system.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2011
Syntax
C#
public double StaticPressure { get; }
Visual Basic
Public ReadOnly Property StaticPressure As Double
	Get
Visual C++
public:
property double StaticPressure {
	double get ();
}
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace